app/Http/Controllers/SearchController.php

select * from `threads` where `title` like '%<script>alert(\'XSS!\')</script>%' or `description` like '%<script>alert(\'XSS!\')</script>%'
select * from `posts` where `message` like '%<script>alert(\'XSS!\')</script>%'
---
    public function getSearch(Request $request)
    {
        $validatedData = $request->validate([
            'term' => 'required|string|max:255'
        ]);

        $term = $validatedData['term'];

        $threads = Thread::where('title', 'like', '%' . $term . '%')
                ->orWhere('description', 'like', '%' . $term . '%')
                ->get();

        $posts = Post::with('thread')
                ->where('message', 'like', '%' . $term . '%')
                ->get();